create_clock -period 3.333 -name RX_lclk_p -waveform {0.000 1.666} [get_ports RX_lclk_p]

#set_input_delay -clock [get_clocks RX_lclk_p] -clock_fall -min -add_delay 0.500 [get_ports {RX_data_n[*]}]
#set_input_delay -clock [get_clocks RX_lclk_p] -clock_fall -max -add_delay 1.166 [get_ports {RX_data_n[*]}]
#set_input_delay -clock [get_clocks RX_lclk_p] -min -add_delay 0.500 [get_ports {RX_data_n[*]}]
#set_input_delay -clock [get_clocks RX_lclk_p] -max -add_delay 1.166 [get_ports {RX_data_n[*]}]
#set_input_delay -clock [get_clocks RX_lclk_p] -clock_fall -min -add_delay 0.500 [get_ports {RX_data_p[*]}]
#set_input_delay -clock [get_clocks RX_lclk_p] -clock_fall -max -add_delay 1.166 [get_ports {RX_data_p[*]}]
#set_input_delay -clock [get_clocks RX_lclk_p] -min -add_delay 0.500 [get_ports {RX_data_p[*]}]
#set_input_delay -clock [get_clocks RX_lclk_p] -max -add_delay 1.166 [get_ports {RX_data_p[*]}]
#set_input_delay -clock [get_clocks RX_lclk_p] -clock_fall -min -add_delay 0.500 [get_ports RX_frame_n]
#set_input_delay -clock [get_clocks RX_lclk_p] -clock_fall -max -add_delay 1.166 [get_ports RX_frame_n]
#set_input_delay -clock [get_clocks RX_lclk_p] -min -add_delay 0.500 [get_ports RX_frame_n]
#set_input_delay -clock [get_clocks RX_lclk_p] -max -add_delay 1.166 [get_ports RX_frame_n]
#set_input_delay -clock [get_clocks RX_lclk_p] -clock_fall -min -add_delay 0.500 [get_ports RX_frame_p]
#set_input_delay -clock [get_clocks RX_lclk_p] -clock_fall -max -add_delay 1.166 [get_ports RX_frame_p]
#set_input_delay -clock [get_clocks RX_lclk_p] -min -add_delay 0.500 [get_ports RX_frame_p]
#set_input_delay -clock [get_clocks RX_lclk_p] -max -add_delay 1.166 [get_ports RX_frame_p]
#set_output_delay -clock [get_clocks VIRTUAL_lclk_s_src] -clock_fall -min -add_delay 0.100 [get_ports {TX_data_n[*]}]
#set_output_delay -clock [get_clocks VIRTUAL_lclk_s_src] -clock_fall -max -add_delay 1.567 [get_ports {TX_data_n[*]}]
#set_output_delay -clock [get_clocks VIRTUAL_lclk_s_src] -min -add_delay 0.100 [get_ports {TX_data_n[*]}]
#set_output_delay -clock [get_clocks VIRTUAL_lclk_s_src] -max -add_delay 1.567 [get_ports {TX_data_n[*]}]
#set_output_delay -clock [get_clocks VIRTUAL_lclk_s_src] -clock_fall -min -add_delay 0.100 [get_ports {TX_data_p[*]}]
#set_output_delay -clock [get_clocks VIRTUAL_lclk_s_src] -clock_fall -max -add_delay 1.567 [get_ports {TX_data_p[*]}]
#set_output_delay -clock [get_clocks VIRTUAL_lclk_s_src] -min -add_delay 0.100 [get_ports {TX_data_p[*]}]
#set_output_delay -clock [get_clocks VIRTUAL_lclk_s_src] -max -add_delay 1.567 [get_ports {TX_data_p[*]}]
#set_output_delay -clock [get_clocks VIRTUAL_lclk_s_src] -clock_fall -min -add_delay 0.100 [get_ports TX_frame_n]
#set_output_delay -clock [get_clocks VIRTUAL_lclk_s_src] -clock_fall -max -add_delay 1.567 [get_ports TX_frame_n]
#set_output_delay -clock [get_clocks VIRTUAL_lclk_s_src] -min -add_delay 0.100 [get_ports TX_frame_n]
#set_output_delay -clock [get_clocks VIRTUAL_lclk_s_src] -max -add_delay 1.567 [get_ports TX_frame_n]
#set_output_delay -clock [get_clocks VIRTUAL_lclk_s_src] -clock_fall -min -add_delay 0.100 [get_ports TX_frame_p]
#set_output_delay -clock [get_clocks VIRTUAL_lclk_s_src] -clock_fall -max -add_delay 1.567 [get_ports TX_frame_p]
#set_output_delay -clock [get_clocks VIRTUAL_lclk_s_src] -min -add_delay 0.100 [get_ports TX_frame_p]
#set_output_delay -clock [get_clocks VIRTUAL_lclk_s_src] -max -add_delay 1.567 [get_ports TX_frame_p]

set_false_path -from [get_clocks clk_fpga_0] -to [get_clocks cclk_p_src]
set_false_path -from [get_clocks clk_fpga_0] -to [get_clocks lclk_p_src]
set_false_path -from [get_clocks clk_fpga_0] -to [get_clocks eio_rx_0_rxlclk_p]
set_false_path -from [get_clocks eio_rx_0_rxlclk_p] -to [get_clocks clk_fpga_0]

#set_false_path -from [get_pins {elink2_top_i/proc_sys_reset_0/U0/PR_OUT_DFF[0].peripheral_reset_reg[0]/C}] -to [get_pins {elink2_top_i/elink2/eio_rx_0/inst/rxenb_sync_reg[*]/CLR}]
#set_false_path -from [get_pins {elink2_top_i/proc_sys_reset_0/U0/PR_OUT_DFF[0].peripheral_reset_reg[0]/C}] -to [get_pins {elink2_top_i/elink2/eproto_tx_0/inst/txdata_p_reg[*]/CLR}]
#set_false_path -from [get_pins {elink2_top_i/proc_sys_reset_0/U0/PR_OUT_DFF[0].peripheral_reset_reg[0]/C}] -to [get_pins elink2_top_i/elink2/eclock_0/inst/gen_cclk_div.OSERDESE2_inst/RST]
#set_false_path -from [get_pins {elink2_top_i/proc_sys_reset_0/U0/PR_OUT_DFF[0].peripheral_reset_reg[0]/C}] -to [get_pins {elink2_top_i/elink2/eio_tx_0/inst/gen_serdes[*].OSERDESE2_txdata/RST}]
#set_false_path -from [get_pins {elink2_top_i/proc_sys_reset_0/U0/PR_OUT_DFF[0].peripheral_reset_reg[0]/C}] -to [get_pins elink2_top_i/elink2/eio_tx_0/inst/OSERDESE2_tframe/RST]
#set_false_path -from [get_pins {elink2_top_i/proc_sys_reset_0/U0/PR_OUT_DFF[0].peripheral_reset_reg[0]/C}] -to [get_pins {elink2_top_i/elink2/earb_0/inst/fifo_data_reg[*]/R}]

#set_false_path -from [get_pins {elink2_top_i/elink2/eio_tx_0/inst/txenb_out_sync_reg[0]/C}] -to [get_pins elink2_top_i/elink2/eio_tx_0/inst/oddr_lclk_inst/D1]

#set_false_path -from [get_pins {elink2_top_i/elink2/eio_rx_0/inst/ecfg_datain_reg[*]/C}] -to [get_pins {elink2_top_i/elink2/eCfg_0/inst/ecfg_datain_reg_reg[*]/D}]

#set_false_path -from [get_pins {elink2_top_i/elink2/eCfg_0/inst/ecfg_cfgclk_reg_reg[1]/C}] -to [get_pins elink2_top_i/elink2/eclock_0/inst/gen_cclk_div.enb_sync_reg/D]
#set_false_path -from [get_pins {elink2_top_i/elink2/eCfg_0/inst/ecfg_cfgclk_reg_reg[2]/C}] -to [get_pins elink2_top_i/elink2/eclock_0/inst/gen_cclk_div.enb_sync_reg/D]
#set_false_path -from [get_pins {elink2_top_i/elink2/eCfg_0/inst/ecfg_cfgclk_reg_reg[*]/C}] -to [get_pins {elink2_top_i/elink2/eclock_0/inst/gen_cclk_div.clk_div_sync_reg[*]/D}]

#set_false_path -from [get_pins {elink2_top_i/elink2/eCfg_0/inst/ecfg_cfgrx_reg_reg[0]/C}] -to [get_pins {elink2_top_i/elink2/eio_rx_0/inst/rxenb_sync_reg[*]/CLR}]
#set_false_path -from [get_pins {elink2_top_i/elink2/eCfg_0/inst/ecfg_cfgrx_reg_reg[1]/C}] -to [get_pins {elink2_top_i/elink2/edistrib_0/inst/rxmmu_sync_reg[1]/D}]
#set_false_path -from [get_pins {elink2_top_i/elink2/eCfg_0/inst/ecfg_cfgrx_reg_reg[2]/C}] -to [get_pins {elink2_top_i/elink2/eio_rx_0/inst/rxloopback_sync_reg[1]/D}]
#set_false_path -from [get_pins {elink2_top_i/elink2/eCfg_0/inst/ecfg_cfgrx_reg_reg[2]/C}] -to [get_pins {elink2_top_i/elink2/eio_rx_0/inst/rxgpio_sync_reg[1]/D}]
#set_false_path -from [get_pins {elink2_top_i/elink2/eCfg_0/inst/ecfg_cfgrx_reg_reg[3]/C}] -to [get_pins {elink2_top_i/elink2/eio_rx_0/inst/rxgpio_sync_reg[1]/D}]
#set_false_path -from [get_pins {elink2_top_i/elink2/eCfg_0/inst/ecfg_cfgrx_reg_reg[3]/C}] -to [get_pins {elink2_top_i/elink2/eio_rx_0/inst/rxloopback_sync_reg[1]/D}]

#set_false_path -from [get_pins {elink2_top_i/elink2/eCfg_0/inst/ecfg_cfgtx_reg_reg[0]/C}] -to [get_pins {elink2_top_i/elink2/eio_tx_0/inst/txenb_out_sync_reg[1]/D}]
#set_false_path -from [get_pins {elink2_top_i/elink2/eCfg_0/inst/ecfg_cfgtx_reg_reg[2]/C}] -to [get_pins {elink2_top_i/elink2/eio_tx_0/inst/txgpio_sync_reg[1]/D}]
#set_false_path -from [get_pins {elink2_top_i/elink2/eCfg_0/inst/ecfg_cfgtx_reg_reg[3]/C}] -to [get_pins {elink2_top_i/elink2/eio_tx_0/inst/txgpio_sync_reg[1]/D}]

#set_false_path -from [get_pins {elink2_top_i/elink2/eCfg_0/inst/ecfg_dataout_reg_reg[*]/C}] -to [get_pins {elink2_top_i/elink2/eio_tx_0/inst/pframe_reg[*]/D}]
#set_false_path -from [get_pins {elink2_top_i/elink2/eCfg_0/inst/ecfg_dataout_reg_reg[*]/C}] -to [get_pins {elink2_top_i/elink2/eio_tx_0/inst/pdata_reg[*]/D}]


