create_clock -period 3.333 -name RX_lclk_p -waveform {0.000 1.666} [get_ports RX_lclk_p]

#set_input_delay -clock [get_clocks RX_lclk_p] -clock_fall -min -add_delay 0.500 [get_ports {RX_data_n[*]}]
#set_input_delay -clock [get_clocks RX_lclk_p] -clock_fall -max -add_delay 1.166 [get_ports {RX_data_n[*]}]
#set_input_delay -clock [get_clocks RX_lclk_p] -min -add_delay 0.500 [get_ports {RX_data_n[*]}]
#set_input_delay -clock [get_clocks RX_lclk_p] -max -add_delay 1.166 [get_ports {RX_data_n[*]}]
#set_input_delay -clock [get_clocks RX_lclk_p] -clock_fall -min -add_delay 0.500 [get_ports {RX_data_p[*]}]
#set_input_delay -clock [get_clocks RX_lclk_p] -clock_fall -max -add_delay 1.166 [get_ports {RX_data_p[*]}]
#set_input_delay -clock [get_clocks RX_lclk_p] -min -add_delay 0.500 [get_ports {RX_data_p[*]}]
#set_input_delay -clock [get_clocks RX_lclk_p] -max -add_delay 1.166 [get_ports {RX_data_p[*]}]
#set_input_delay -clock [get_clocks RX_lclk_p] -clock_fall -min -add_delay 0.500 [get_ports RX_frame_n]
#set_input_delay -clock [get_clocks RX_lclk_p] -clock_fall -max -add_delay 1.166 [get_ports RX_frame_n]
#set_input_delay -clock [get_clocks RX_lclk_p] -min -add_delay 0.500 [get_ports RX_frame_n]
#set_input_delay -clock [get_clocks RX_lclk_p] -max -add_delay 1.166 [get_ports RX_frame_n]
#set_input_delay -clock [get_clocks RX_lclk_p] -clock_fall -min -add_delay 0.500 [get_ports RX_frame_p]
#set_input_delay -clock [get_clocks RX_lclk_p] -clock_fall -max -add_delay 1.166 [get_ports RX_frame_p]
#set_input_delay -clock [get_clocks RX_lclk_p] -min -add_delay 0.500 [get_ports RX_frame_p]
#set_input_delay -clock [get_clocks RX_lclk_p] -max -add_delay 1.166 [get_ports RX_frame_p]
#set_output_delay -clock [get_clocks VIRTUAL_lclk_s_src] -clock_fall -min -add_delay 0.100 [get_ports {TX_data_n[*]}]
#set_output_delay -clock [get_clocks VIRTUAL_lclk_s_src] -clock_fall -max -add_delay 1.567 [get_ports {TX_data_n[*]}]
#set_output_delay -clock [get_clocks VIRTUAL_lclk_s_src] -min -add_delay 0.100 [get_ports {TX_data_n[*]}]
#set_output_delay -clock [get_clocks VIRTUAL_lclk_s_src] -max -add_delay 1.567 [get_ports {TX_data_n[*]}]
#set_output_delay -clock [get_clocks VIRTUAL_lclk_s_src] -clock_fall -min -add_delay 0.100 [get_ports {TX_data_p[*]}]
#set_output_delay -clock [get_clocks VIRTUAL_lclk_s_src] -clock_fall -max -add_delay 1.567 [get_ports {TX_data_p[*]}]
#set_output_delay -clock [get_clocks VIRTUAL_lclk_s_src] -min -add_delay 0.100 [get_ports {TX_data_p[*]}]
#set_output_delay -clock [get_clocks VIRTUAL_lclk_s_src] -max -add_delay 1.567 [get_ports {TX_data_p[*]}]
#set_output_delay -clock [get_clocks VIRTUAL_lclk_s_src] -clock_fall -min -add_delay 0.100 [get_ports TX_frame_n]
#set_output_delay -clock [get_clocks VIRTUAL_lclk_s_src] -clock_fall -max -add_delay 1.567 [get_ports TX_frame_n]
#set_output_delay -clock [get_clocks VIRTUAL_lclk_s_src] -min -add_delay 0.100 [get_ports TX_frame_n]
#set_output_delay -clock [get_clocks VIRTUAL_lclk_s_src] -max -add_delay 1.567 [get_ports TX_frame_n]
#set_output_delay -clock [get_clocks VIRTUAL_lclk_s_src] -clock_fall -min -add_delay 0.100 [get_ports TX_frame_p]
#set_output_delay -clock [get_clocks VIRTUAL_lclk_s_src] -clock_fall -max -add_delay 1.567 [get_ports TX_frame_p]
#set_output_delay -clock [get_clocks VIRTUAL_lclk_s_src] -min -add_delay 0.100 [get_ports TX_frame_p]
#set_output_delay -clock [get_clocks VIRTUAL_lclk_s_src] -max -add_delay 1.567 [get_ports TX_frame_p]


set_false_path -from [get_clocks -of_objects [get_pins elink2_top_i/elink2/eio_rx_0/inst/clkout_bufr/O]] -to [get_clocks clk_fpga_0]
set_false_path -from [get_clocks -of_objects [get_pins elink2_top_i/elink2/eclock_0/inst/eclk_pll/CLKOUT3]] -to [get_clocks -of_objects [get_pins elink2_top_i/elink2/eio_rx_0/inst/clkout_bufr/O]]
set_false_path -from [get_clocks clk_fpga_0] -to [get_clocks -of_objects [get_pins elink2_top_i/elink2/eio_rx_0/inst/clkout_bufr/O]]
set_false_path -from [get_clocks clk_fpga_0] -to [get_clocks -of_objects [get_pins elink2_top_i/elink2/eclock_0/inst/eclk_pll/CLKOUT4]]
set_false_path -from [get_clocks clk_fpga_0] -to [get_clocks -of_objects [get_pins elink2_top_i/elink2/eclock_0/inst/eclk_pll/CLKOUT3]]

set_multicycle_path -from [get_pins {elink2_top_i/elink2/eio_tx_0/inst/txenb_out_sync_reg[0]/C}] -to [get_pins elink2_top_i/elink2/eio_tx_0/inst/oddr_lclk_inst/D1] 2
